cases/periodicHill/steadyState_kOmega_2D/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

canCompile || exit 0    # Dynamic code

restore0Dir

runApplication blockMesh

runApplication topoSet

# 1-cell-thick (empty front/back) 2D approximation -- ~32k cells, runs
# serially in a couple of minutes, no decomposition needed.
#
# Diagnostic only, like steadyState_kOmegaDavidsonNN_2D: standard kOmega
# also fails to hold a steady solution on this flow -- instability visible
# from ~iteration 288, diverging to a floating-point exception by ~508.
# Matches Davidson (2026) Sec. 5.3, which never runs a steady RANS stage
# for either turbulence model on the hill flow, going straight to unsteady
# marching-to-steady-state (see transient_kOmega_2D). Not part of the
# 4-way comparison; kept for provenance alongside its kOmegaDavidsonNN
# counterpart. Allrun is expected to end with "Floating point exception".
runApplication $(getApplication)

#------------------------------------------------------------------------------
