cases/periodicHill/steadyState_kOmega_2D/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2606                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1500;

deltaT          1;

writeControl    timeStep;

writeInterval   100;

purgeWrite      3;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    // Registers the modelled Reynolds-stress tensor R (Boussinesq:
    // -2*nut*symm(gradU) + 2/3*I*k) so it can be sampled below -- the
    // correct total turbulent shear stress for a converged *steady* RANS
    // solve (no resolved unsteadiness to average, unlike the transient
    // kOmegaDavidsonNN/tutorial cases).
    turbulenceFields1
    {
        type            turbulenceFields;
        libs            (fieldFunctionObjects);
        fields          (R);
        executeControl  onEnd;
        writeControl    none;
    }

    // Matches the station list, z-plane and output convention already
    // used by transient_kOmegaDavidsonNN_2D and the stock tutorial's
    // transient/system/controlDict, so postprocess_hill.py can read all
    // cases uniformly.
    sample
    {
        type            sets;
        libs            (sampling);
        interpolationScheme cellPoint;
        setFormat       raw;
        executeControl  onEnd;
        writeControl    onEnd;

        fields
        (
            U
            k
            R
        );

        sets
        {
            xbyh0.05
            {
                type            face;
                axis            y;
                start           (0.0014 0 0.063);
                end             (0.0014 1 0.063);
            }
            xbyh0.5
            {
                type            face;
                axis            y;
                start           (0.014 0 0.063);
                end             (0.014 1 0.063);
            }
            xbyh1
            {
                type            face;
                axis            y;
                start           (0.028 0 0.063);
                end             (0.028 1 0.063);
            }
            xbyh2
            {
                type            face;
                axis            y;
                start           (0.056 0 0.063);
                end             (0.056 1 0.063);
            }
            xbyh3
            {
                type            face;
                axis            y;
                start           (0.084 0 0.063);
                end             (0.084 1 0.063);
            }
            xbyh4
            {
                type            face;
                axis            y;
                start           (0.112 0 0.063);
                end             (0.112 1 0.063);
            }
            xbyh5
            {
                type            face;
                axis            y;
                start           (0.140 0 0.063);
                end             (0.140 1 0.063);
            }
            xbyh6
            {
                type            face;
                axis            y;
                start           (0.168 0 0.063);
                end             (0.168 1 0.063);
            }
            xbyh7
            {
                type            face;
                axis            y;
                start           (0.196 0 0.063);
                end             (0.196 1 0.063);
            }
            xbyh8
            {
                type            face;
                axis            y;
                start           (0.224 0 0.063);
                end             (0.224 1 0.063);
            }
        }
    }
}


// ************************************************************************* //
